#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/holistic-shield/gh-actions-holistic-shield-website-dev/runs/run-8bdV2i4oYtmN6g2f

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.website.data.aws_acm_certificate.holistic_shield: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.website.data.aws_iam_policy_document.policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.website.aws_iam_role.website_public will be created
  + resource "aws_iam_role" "website_public" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-holistic-shield-website-public"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"   = "dev"
          + "Name"  = "Holistic Shield"
          + "Owner" = "Thageesan Thanabalasingam"
          + "Role"  = "holistic-shield"
        }
      + tags_all              = {
          + "Env"   = "dev"
          + "Name"  = "Holistic Shield"
          + "Owner" = "Thageesan Thanabalasingam"
          + "Role"  = "holistic-shield"
        }
      + unique_id             = (known after apply)
    }

  # module.website.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "www.dev.holisticshield.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.website.aws_s3_bucket_acl.acl will be created
  + resource "aws_s3_bucket_acl" "acl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.website.aws_s3_bucket_ownership_controls.ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.website.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.website.aws_s3_bucket_public_access_block.access will be created
  + resource "aws_s3_bucket_public_access_block" "access" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.website.aws_s3_bucket_website_configuration.configuration will be created
  + resource "aws_s3_bucket_website_configuration" "configuration" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Error: reading ACM Certificate (arn:aws:acm:us-east-1:476300006968:certificate/f3874601-afb4-4f5c-b4a1-48707da4daef): AccessDeniedException: User: arn:aws:iam::476300006968:user/holisticshield_deployment is not authorized to perform: acm:GetCertificate on resource: arn:aws:acm:us-east-1:476300006968:certificate/f3874601-afb4-4f5c-b4a1-48707da4daef because no identity-based policy allows the acm:GetCertificate action
│ 
│   with module.website.data.aws_acm_certificate.holistic_shield,
│   on modules/main.tf line 1, in data "aws_acm_certificate" "holistic_shield":
│    1: data "aws_acm_certificate" "holistic_shield" {
│ 
╵
Operation failed: failed running terraform plan (exit 1)

```

</details>

*Pusher: @thageesan, Action: `pull_request`*